oc_parallel_contrast/src/main/resources/resource/fk-message.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://common.ws.yn.oss.ztesoft.com">
    <soapenv:Header/>
    <soapenv:Body>
        <com:rscService soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <infType xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">resAssignResponse</infType>
            <head xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"></head>
            <body xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
                <![CDATA[
        <?xml version="1.0" encoding="UTF-8"?>
<root><expInfo><orderItem>
      <itemSpecId>10005</itemSpecId>
      <desc>保留程控</desc>
      <seq>1</seq>
      <newItemVal>0PA013</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10005</itemSpecId>
      <desc>保留程控</desc>
      <seq>2</seq>
      <newItemVal>0PA026</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10005</itemSpecId>
      <desc>保留程控</desc>
      <seq>3</seq>
      <newItemVal>0PA040</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10005</itemSpecId>
      <desc>保留程控</desc>
      <seq>4</seq>
      <newItemVal>6600409143</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300039</itemSpecId>
      <desc>是否混合放号</desc>
      <seq>1</seq>
      <newItemVal>0</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300037</itemSpecId>
      <desc>昆明支撑操作点</desc>
      <seq>200</seq>
      <newItemVal>71037</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300129</itemSpecId>
      <desc>定单经过环节</desc>
      <seq>1</seq>
      <newItemVal>A|获|十</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300055</itemSpecId>
      <desc>是否必须多PVC端口</desc>
      <seq>1</seq>
      <newItemVal>0</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300084</itemSpecId>
      <desc>同址电话标识</desc>
      <seq>1</seq>
      <newItemVal>999</newItemVal>
      <oldItemVal>999</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>300109</itemSpecId>
      <desc>服务开通定单标识</desc>
      <seq>1</seq>
      <newItemVal>1276675</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300122</itemSpecId>
      <desc>DDN MODEN来源</desc>
      <seq>1</seq>
      <newItemVal>自备</newItemVal>
      <oldItemVal>自备</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>10092</itemSpecId>
      <desc>付费方式</desc>
      <seq>1</seq>
      <newItemVal>1201</newItemVal>
      <oldItemVal>1201</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>300068</itemSpecId>
      <desc>定单主题</desc>
      <seq>1</seq>
      <newItemVal>固定电话 - 改号</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10001</itemSpecId>
      <desc>产品实例ID</desc>
      <seq>1</seq>
      <newItemVal>2860</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10002</itemSpecId>
      <desc>产品ID</desc>
      <seq>1</seq>
      <newItemVal>6600128000</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10045</itemSpecId>
      <desc>服务编码</desc>
      <seq>1</seq>
      <newItemVal>4A004</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>301002</itemSpecId>
      <desc>接入方式</desc>
      <seq>1</seq>
      <newItemVal>2</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300061</itemSpecId>
      <desc>受理操作点</desc>
      <seq>1</seq>
      <newItemVal>600277</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300041</itemSpecId>
      <desc>营业备注</desc>
      <seq>1</seq>
      <newItemVal> 定单主题：固定电话 - 改号</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10139</itemSpecId>
      <desc>新接入号码</desc>
      <seq>1</seq>
      <newItemVal>63108255</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10141</itemSpecId>
      <desc>旧接入号码</desc>
      <seq>1</seq>
      <newItemVal>63108255</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10620</itemSpecId>
      <desc>计费号码</desc>
      <seq>1</seq>
      <newItemVal>63108255</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10082</itemSpecId>
      <desc>地区ID</desc>
      <seq>1</seq>
      <newItemVal>8530103</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300097</itemSpecId>
      <desc>客户ID</desc>
      <seq>1</seq>
      <newItemVal>740625</newItemVal>
      <oldItemVal>740625</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>10035</itemSpecId>
      <desc>客户名称</desc>
      <seq>1</seq>
      <newItemVal>傅素君</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10043</itemSpecId>
      <desc>客户类型名称</desc>
      <seq>1</seq>
      <newItemVal>政企客户</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10397</itemSpecId>
      <desc>客户级别</desc>
      <seq>1</seq>
      <newItemVal>普通</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>30005</itemSpecId>
      <desc>局向ID</desc>
      <seq>1</seq>
      <newItemVal>101124164</newItemVal>
      <oldItemVal>101129120</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>300062</itemSpecId>
      <desc>受理员工</desc>
      <seq>1</seq>
      <newItemVal>徐奇</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10020</itemSpecId>
      <desc>装机地址</desc>
      <seq>1</seq>
      <newItemVal>云南省昆明市盘龙区盘龙路29号省药检所宿舍1栋1单元701室</newItemVal>
      <oldItemVal>云南省昆明市盘龙区盘龙路29号省药检所宿舍1栋1单元701室</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>10022</itemSpecId>
      <desc>联系人</desc>
      <seq>1</seq>
      <newItemVal>傅素君TG</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10023</itemSpecId>
      <desc>联系电话</desc>
      <seq>1</seq>
      <newItemVal>15308895347</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300054</itemSpecId>
      <desc>用户名称</desc>
      <seq>1</seq>
      <newItemVal>傅素君TG</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>10042</itemSpecId>
      <desc>标准地址ID</desc>
      <seq>1</seq>
      <newItemVal>5238250</newItemVal>
      <oldItemVal>5238250</oldItemVal>
    </orderItem><orderItem>
      <itemSpecId>300065</itemSpecId>
      <desc>同笔定单号</desc>
      <seq>1</seq>
      <newItemVal>600006214403</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300051</itemSpecId>
      <desc>工单到达时间</desc>
      <seq>1</seq>
      <newItemVal>2022-01-12 15:08:37</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300052</itemSpecId>
      <desc>预警时间</desc>
      <seq>1</seq>
      <newItemVal>2022-01-12 15:53:36</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300053</itemSpecId>
      <desc>告警时间</desc>
      <seq>1</seq>
      <newItemVal>2022-01-12 16:38:36</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300037</itemSpecId>
      <desc>默认操作点</desc>
      <seq>1</seq>
      <newItemVal>048</newItemVal>
      <oldItemVal/>
    </orderItem><orderItem>
      <itemSpecId>300130</itemSpecId>
      <desc>4G号码已迁出标识</desc>
      <seq>1</seq>
      <newItemVal>0</newItemVal>
      <oldItemVal/>
    </orderItem></expInfo><baseInfo>
    <orderId>8712201121321325660</orderId>
    <workOrderId>5829755</workOrderId>
    <actionNo>骆</actionNo>
    <assignType>骆</assignType>
    <seq/>
    <productId>6600128000</productId>
    <accessNumber>63108255</accessNumber>
    <accessType>1</accessType>
    <InstallFlag>0</InstallFlag>
    <inteOrderDispSeq>1</inteOrderDispSeq>
    <orgId/>
    <dispStaffId/>
    <stateDate>2022-01-12 15:08:37</stateDate>
    <returnId/>
    <displDate/>
    <complDate/>
    <handingStaffId/>
    <remarks/>
    <orderFlag/>
    <areaId>8530103</areaId>
  </baseInfo></root>
]]>
            </body>
        </com:rscService>
    </soapenv:Body>
</soapenv:Envelope>